In [1]:
import pandas as pd
import numpy as np
from pandas import Series,DataFrame

In [2]:
df = DataFrame(np.arange(10).reshape(2,5))
df

   0  1  2  3  4
0  0  1  2  3  4
1  5  6  7  8  9

In [4]:
#df.index = df.index.map()

In [9]:
df.rename(index={0:'A'},columns={0:'a'})

   a  1  2  3  4
A  0  1  2  3  4
1  5  6  7  8  9

In [10]:
df

   0  1  2  3  4
A  0  1  2  3  4
1  5  6  7  8  9

In [11]:
df.rename({0:'A'},inplace=True)

In [8]:
df

   0  1  2  3  4
A  0  1  2  3  4
1  5  6  7  8  9